{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution24_weight", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution24_bias", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution24", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "10"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation36", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling24", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout36", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten12", 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fcl_1_weight", 
      "attrs": {"num_hidden": "60"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcl_1_bias", 
      "attrs": {"num_hidden": "60"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fcl_1", 
      "attrs": {"num_hidden": "60"}, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation38", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fcl_2_weight", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fcl_2_bias", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fcl_2", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lin_reg_label", 
      "inputs": []
    }, 
    {
      "op": "LinearRegressionOutput", 
      "name": "NN_model", 
      "inputs": [[14, 0, 0], [15, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 8, 9, 12, 13, 15], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18
  ], 
  "heads": [[16, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}