{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution32_weight", 
      "attrs": {
        "kernel": "(7, 7)", 
        "num_filter": "5"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution32_bias", 
      "attrs": {
        "kernel": "(7, 7)", 
        "num_filter": "5"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution32", 
      "attrs": {
        "kernel": "(7, 7)", 
        "num_filter": "5"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation48", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling32", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout48", 
      "attrs": {"p": "0.2"}, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution33_weight", 
      "attrs": {
        "kernel": "(7, 7)", 
        "num_filter": "70"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution33_bias", 
      "attrs": {
        "kernel": "(7, 7)", 
        "num_filter": "70"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution33", 
      "attrs": {
        "kernel": "(7, 7)", 
        "num_filter": "70"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation49", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling33", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout49", 
      "attrs": {"p": "0.2"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten16", 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected32_weight", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected32_bias", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected32", 
      "attrs": {"num_hidden": "50"}, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation50", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout50", 
      "attrs": {"p": "0.2"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected33_weight", 
      "attrs": {"num_hidden": "3"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected33_bias", 
      "attrs": {"num_hidden": "3"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected33", 
      "attrs": {"num_hidden": "3"}, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmaxoutput16_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmaxoutput16", 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 7, 8, 14, 15, 19, 20, 22], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27
  ], 
  "heads": [[23, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}